// #################################################################################################
// UsersDTO.java - USERS 테이블 정보 전달용 DTO
// #################################################################################################
// ═════════════════════════════════════════════════════════════════════════════════════════
// 외부모듈 영역
// ═════════════════════════════════════════════════════════════════════════════════════════
package BeansUsers;

import Common.ExceptionMgr;

// ═════════════════════════════════════════════════════════════════════════════════════════
// 사용자정의 클래스 영역
// ═════════════════════════════════════════════════════════════════════════════════════════
/***********************************************************************
 * UsersDTO	: 기본 DTO 클래스<br>
 * Inheritance	: None
 ***********************************************************************/
public class UsersDTO
{
	// —————————————————————————————————————————————————————————————————————————————————————
	// 전역상수 관리 - 필수영역
	// —————————————————————————————————————————————————————————————————————————————————————
	
	// —————————————————————————————————————————————————————————————————————————————————————
	// 전역변수 관리 - 필수영역(정적변수)
	// —————————————————————————————————————————————————————————————————————————————————————
    
	// —————————————————————————————————————————————————————————————————————————————————————
	// 전역변수 관리 - 필수영역(인스턴스변수)
	// —————————————————————————————————————————————————————————————————————————————————————
	// 사용자 아이디 : 20자리 숫자
	private Integer user_id 	= null;
	
	// 이메일 : 30바이트 이내 문자(한글 제외)
	private String 	email 		= null;
	
	// 비밀번호 : 8바이트 이상, 12바이트 이내 문자(한글 제외)
	private String 	password 	= null;
	
	// 닉네임 : 8글자 이내 문자
	private String 	nickname 	= null;
	
	// 생일 : 'YYYY-MM-DD' 포맷의 문자(DB 사이드에서 DATE 타입으로 변환)
	private String 	birthday 	= null;
	
	// 전화번호 : 전화번호 뒤 4자리, 4자리 문자(숫자만 가능)
	private String 	tel 		= null;
	
	// 교육과정 : 3자리 이내 숫자
	private Integer course 		= null;
	// —————————————————————————————————————————————————————————————————————————————————————
    // 생성자 관리 - 필수영역(인스턴스함수)
	// —————————————————————————————————————————————————————————————————————————————————————
	/***********************************************************************
	 * UsersDTO()	: 생성자
	 * @param void	: None
	 ***********************************************************************/
	public UsersDTO()
	{
		try
		{
			// -----------------------------------------------------------------------------
			// 기타 초기화 작업 관리
			// -----------------------------------------------------------------------------
			ExceptionMgr.SetMode(ExceptionMgr.RUN_MODE.DEBUG);
			// -----------------------------------------------------------------------------
		}
		catch (Exception Ex)
		{
			ExceptionMgr.DisplayException(Ex);		// 예외처리(콘솔)
		}
    }
	// —————————————————————————————————————————————————————————————————————————————————————
	// 전역함수 관리 - 필수영역(정적함수)
	// —————————————————————————————————————————————————————————————————————————————————————
	
	// —————————————————————————————————————————————————————————————————————————————————————
	// 전역함수 관리 - 필수영역(인스턴스함수)
	// —————————————————————————————————————————————————————————————————————————————————————
	public Integer getUser_id()
	{
		return user_id;
	}

	public void setUser_id(Integer user_id)
	{
		this.user_id = user_id;
	}

	public String getEmail()
	{
		return email;
	}

	public void setEmail(String email)
	{
		this.email = email;
	}

	public String getPassword()
	{
		return password;
	}

	public void setPassword(String password)
	{
		this.password = password;
	}

	public String getNickname()
	{
		return nickname;
	}

	public void setNickname(String nickname)
	{
		this.nickname = nickname;
	}

	public String getBirthday()
	{
		return birthday;
	}

	public void setBirthday(String birthday)
	{
		this.birthday = birthday;
	}

	public String getTel()
	{
		return tel;
	}

	public void setTel(String tel)
	{
		this.tel = tel;
	}

	public Integer getCourse()
	{
		return course;
	}

	public void setCourse(Integer course)
	{
		this.course = course;
	}
}
// #################################################################################################
// <END>
// #################################################################################################
